package com.lesson.lesson002.home.work;

// Работа с выводом
// Создать программу которая напечаетает приветственное окно для сервера
// В приветственное окно должно входить информация о ip-address, количество свободной памяти, загруженности ядер процессора и количество пользователей онлайн
// Вся информация абсолютно произвольная, твоя задача лишь красиво написать это окно, через текстовый интерфейс
public class Hw1 {
    public static void main(String[] args) {

        System.out.println("IP-адресс: 192.168.1.2");
        System.out.println("Количество свободной памяти на устройстве: 7953645 ГБ");
        System.out.println("ЯДро процессора загружено на 53%");
        System.out.println("Количество пользователей онлайн: 1152");


    }

}
