package com.lesson.lesson002.home.work;

// Создать 3 переменные, отвечающие за характеристику квартиры: цена, количество комнат, этаж(1-9)
// Пользователю дать возможность ввести значения с клавиатуры
// Проверить соответсвует ли квартира следующим условиям
// 1) Находится между 3-9 этажом и количество комнат больше 2
// 2) не первый этаж и цена меньше 1500_000 рублей
// 3) количество комнат больше 3 или цена не больше 1000_000
public class Hw6 {
    public static void main(String[] args) {




    }
}
